Revit 2024 API
StructuralSectionAnalysisParams Constructor
Overload List
Name | Description
StructuralSectionAnalysisParams()
 Creates a new instance of StructuralSectionAnalysisParams.
StructuralSectionAnalysisParams(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double)
 Creates a new instance of StructuralSectionAnalysisParams.
See Also
StructuralSectionAnalysisParams Class
StructuralSectionAnalysisParams Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace